assign3/kepsilon/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          248;
        startFace       33502;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          218;
        startFace       33750;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       33968;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       34018;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          33800;
        startFace       34098;
    }
)

// ************************************************************************* //
