assign3/kepsilon/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (300 0 0)
	(0 25 0)
	(300 25 0)
	(0 50 0)
	(300 50 0)
	(0 0 1)
	(300 0 1)
	(0 25 1)
	(300 25 1)
	(0 50 1)
	(300 50 1)
	(-20 25 0)
	(-20 50 0)
	(-20 25 1)
	(-20 50 1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (200 30 1) simpleGrading (2 0.5 1)
    hex (2 3 5 4 8 9 11 10) (200 50 1) simpleGrading (2 0.5 1)
    hex (12 2 4 13 14 8 10 15) (18 50 1) simpleGrading (0.5 0.5 1)
);

edges
(
);

boundary
(
    lowerWall
    {
        type            wall;
        faces           ((0 1 7 6)
        		(12 2 8 14)
        		(2 0 6 8));
    }
    upperWall
    {
        type            wall;
        faces           ((4 10 11 5)
        		(4 13 15 10));
    }
    
    inlet
    {
        type            patch;
        faces           
	(
	      (15 13 12 14)
	);
    }
    outlet
    {
        type            patch;
        faces           
	(
	     (1 3 9 7) 
         (3 5 11 9)
	);
    }
    
    frontAndBack
    {
        type            empty;
        faces           
	(
	     (0 2 3 1) 
	     (6 7 9 8) 
	     (2 4 5 3)
	     (8 9 11 10)
	     (14 8 10 15)
	     (13 4 2 12)
	);
    }    
);

mergePatchPairs
(
);

// ************************************************************************* //
